In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic_df = pd.read_csv('titanic_train.csv')

## Aggregation 함수 및 GroupBy

### aggregation

In [3]:
# 이전에 배운 방법
# (NaN 값은 카운트에서 제외됨)
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [8]:
# 특정 column에 대해서, 또는 평균 등의 값을 보고 싶다면?
titanic_df[['Age', 'Fare']].mean(axis=1)

0      14.62500
1      54.64165
2      16.96250
3      44.05000
4      21.52500
         ...
886    20.00000
887    24.50000
888    23.45000
889    28.00000
890    19.87500
Length: 891, dtype: float64

In [5]:
titanic_df[['Age', 'Fare']].sum()
# axis 디폴트 값은 axis=0

Age     21205.1700
Fare    28693.9493
dtype: float64

In [6]:
titanic_df[['Age', 'Fare']].count()

Age     714
Fare    891
dtype: int64

### groupby()
### group by 하고자 하는 칼럼을 입력. 여러개의 칼럼을 group by 할땐 [] 내에 해당 컬럼명을 입력. DataFrame에 groupby() 호출하면 DataFrameGroupBy 객체 반환

In [9]:
titanic_groupby = titanic_df.groupby(by="Pclass")
print(type(titanic_groupby))
print(titanic_groupby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000017BAD7031C8>

### DataFrameGroupBy 객체에 Aggregation함수 호출하여 Group by 수행

In [12]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [14]:
print(type(titanic_groupby))
print(titanic_groupby.shape)
print(titanic_groupby.index)

<class 'pandas.core.frame.DataFrame'>
(3, 11)
Int64Index([1, 2, 3], dtype='int64', name='Pclass')

In [17]:
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [20]:
# 위와 순서를 바꿔서 필요한 컬럼 데이터 추출하고 groupby 가능
titanic_groupby = titanic_df[['Pclass', 'PassengerId', 'Survived']]\
.groupby('Pclass').count()
# 컬럼 데이터 추출할 때 'Pclass' 도 있는 것 주의!!!
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [21]:
# 그냥 Pclass의 count 값만 보고 싶다면?
titanic_df.groupby('Pclass')['Pclass'].count()
# 근데 "titanic_df['Pclass'].value_count" 이용하는게 더 편함

Pclass
1    216
2    184
3    491
Name: Pclass, dtype: int64

### agg 함수=> 여러개의 aggregation 함수 적용가능

In [22]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

### column 별로 다른 aggregation을 구하고 싶다면?
### => 딕셔너리 이용

In [25]:
agg_format = {'Age': 'max', 'SibSp':'sum', 'Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550